[
  {
    "title": "Senior Advocacy Associate / Deputy Legislative Director, Gulf Region",
    "company": "ExcelinEd (Foundation for Excellence in Education)",
    "location": "",
    "url": "https://excelined.org/job-opportunities/senior-advocacy-director-legislative-director-gulf-region/",
    "type": "",
    "description": "ExcelinEd and ExcelinEd in Action This role can be executed virtually in the Gulf Region with a preference for a candidate to be located in Louisiana. Job Summary The Senior Advocacy Associate serves as a member of the Advocacy Team. This person will report to and support the organization’s Regional Advocacy Director, Gulf, in promoting a broad education policy agenda within their region. In partnership with the Regional Advocacy Director, the Senior Advocacy Associate is responsible for executive and legislative branch outreach and engagement, tracking executive and legislative action and communicating regularly with lawmakers, policymakers and state advocates to educate, promote and advance policy solutions that transform education. About ExcelinEd Being a part of ExcelinEd means joining a high-performing and motivated team of education advocates with a shared belief that every child deserves a quality education. Team members are committed to our core values of service, integrity, collaboration, expertise and making a difference. Our organization sets big, hairy audacious goals and works tirelessly to support states in transforming education through a comprehensive student-centered policy agenda that is increasing student learning, expanding opportunity and readying students for higher quality, higher-wage, in-demand jobs. Essential Duties and Responsibilities Monitors and engages in state legislative sessions, meetings of state boards of education and other governmental meetings that impact the organization’s policy agenda. Conducts outreach to the legislative and executive branches within assigned states. Tracks legislation and executive action, reviews policy proposals, and supports policy implementation. Builds partnerships with policymakers and in-state advocacy organizations to promote and advance the organization’s policy agenda. Participates in coalition and state partner meetings and activities. Contributes to the organization’s overall state advocacy strategy by developing annual action plans in assigned regions. Manages and maintains state engagement and bill tracking activities in the organization’s business intelligence and tracking systems. Develops briefing materials for policymaker and executive meetings. Undertakes other interim assignments, as necessary, which may include participating in state and national convenings, developing advocacy resources, tracking, maintaining and analyzing input, output, outcome and legislative impact data, and promoting and supporting the National Summit on Education. Requirements 3+ years of professional experience Bachelor’s degree or equivalent in Social Science, Political Science, Public Administration or other relevant area of study Experience should include working in or around the legislative or executive branch of government in public policy, advocacy, legislative bill drafting, tracking and analysis Preferred Skills/Qualifications Strong organizational, written and communication skills Strong commitment to advocate for transformative education policies General knowledge of education policy and state politics Understanding of political and legislative processes Ability to differentiate between and appropriately manage 501(c)(3) and 501(c)(4) activities Ability to travel approximately 10% To Apply Qualified candidates should submit the following application materials (in order) in one PDF document: Cover letter including: An introductory paragraph(s) describing three distinct reasons you are drawn to ExcelinEd’s mission and how you came to those beliefs Salary requirements Resume Applications should be submitted to Talent Market via this link: talentmarket.org/apply-for-your-dream-job/ . Questions can be directed to Katy Gambella, Director of Outreach at Talent Market, who is managing the search process: katy@talentmarket.org . There is no application deadline for this position. Applications are accepted on a rolling basis. This job will remain posted on our site until it is filled. While we thank all applicants in advance for their interest in this position, we are only able to contact those to whom we can offer an interview. Only direct applications will be considered. No phone calls, please. Talent Market is a nonprofit dedicated to promoting liberty by helping free-market nonprofits identify talent for critical roles. We provide consulting and recruiting services at no cost to 501(c)3 nonprofit organizations that clearly and directly focus on advancing the principles of economic freedom, free enterprise, free trade, free speech, property rights, rule of law, and limited regulation."
  },
  {
    "title": "Associate Director, Grassroots Advocacy",
    "company": "ExcelinEd (Foundation for Excellence in Education)",
    "location": "",
    "url": "https://excelined.org/job-opportunities/associate-director-grassroots-advocacy/",
    "type": "",
    "description": "ExcelinEd in Action / Foundation for Florida’s Future Virtual in Florida Job Summary The Associate Director serves as a member of the Florida Advocacy Team, supporting and implementing strategies and tactics that identify, educate, activate and maintain a network of school leaders, families and community advocates to promote and advance the organization’s school choice and education policy agenda with state policymakers, advocacy partners and media. About Being a part of ExcelinEd means joining a high-performing and motivated team of education advocates with a shared belief that every child deserves a quality education. Team members are committed to our core values of service, integrity, collaboration, expertise and making a difference. Our organization sets big, hairy audacious goals and works tirelessly to support states in transforming education through a comprehensive student-centered policy agenda that is increasing student learning, expanding opportunity and readying students for higher quality, higher-wage, in-demand jobs. Essential Duties and Responsibilities Identifies, engages, trains and activates school and community leaders to promote, advocate and advance school choice and student-centered policy solutions with state policymakers. Supports the development and implementation of school leader and family engagement strategies that align with state legislative priorities. Creates opportunities for state officials to engage with their local school and parent leaders. Manages and tracks outreach activities, including building and maintaining a database of grassroots contacts with a focus on school leaders and parents. Builds relationships and coalitions of support for student-centered education policy solutions with targeted stakeholders, with a focus on cultivating a network of charter and private school leaders as well as parent organizations. Supports the development of compelling grassroots stories into narratives for use in written, video and digital media, as well as committee testimony and panel discussions. Mobilizes school leaders and parents for events supporting school choice policy solutions. Coordinates the travel of school leaders and family advocates for testimony, panels, media events and other public and private advocacy efforts. Organizes regular communications with grassroots supporters to keep school leaders and families engaged in school choice advocacy strategies. Prepares advocacy materials, such as talking points, fact sheets and briefing documents for school leaders, families, policymakers and partners. Prepares reports for leadership on the effectiveness of grassroots strategies and plans, highlighting progress and impact. Preferred Skills/Qualifications Strong written, communication and interpersonal skills Strong organizational and teamwork skills Strong commitment to advocate for public charter and private school choice and a broad agenda of student-centered education policies Knowledge of education policy and state politics Understanding of political and legislative processes Ability to differentiate between 501(c)(3) and 501(c)(4) activities Ability to travel regularly across the state of Florida Requirements Bachelor’s degree or equivalent in Social Science, Political Science, Public Administration, Communications, Social Work, and/or an associated subject 5+ years of experience in policy, advocacy, communications or grassroots advocacy working with schools, families, communities, legislators and/or governments To Apply Qualified candidates may apply online via this job portal link: Job Application: Associate Director, Grassroots Advocacy Required application materials to be submitted online include the following: Employment Application Cover letter detailing your interest in the position, how your background and experience makes you a good fit for the position and your salary requirements Resume Questions can be directed to EmployeeServices@ExcelinEd.org There is no application deadline for this position. Applications are accepted on a rolling basis. This job will remain posted on our site until it is filled. While we thank all applicants in advance for their interest in this position, we are only able to contact those to whom we can offer an interview. Only direct applications will be considered. No phone calls, please."
  },
  {
    "title": "Policy Director, Education Choice",
    "company": "ExcelinEd (Foundation for Excellence in Education)",
    "location": "",
    "url": "https://excelined.org/job-opportunities/policy-director-education-choice-3/",
    "type": "",
    "description": "ExcelinEd Virtual Position Job Summary The Policy Director, Education Choice, is responsible for promoting and advancing a student-centered policy agenda that empowers families with opportunity. The Director manages activities to support state-level policy development and implementation in priority states, with an emphasis on public school choice policy that includes open and part-time enrollment, school transportation, microschools and other innovations that modernize education. As a team member at one of the nation’s foremost education policy organizations, this is a role for a motivated leader with the drive to advance and transform state education through student-centered policy solutions and a creative vision for the evolving school choice landscape and the future of education that empowers families with options. About ExcelinEd Being a part of ExcelinEd means joining a high-performing and motivated team of education advocates with a shared belief that every child deserves a quality education. Team members are committed to our core values of service, integrity, collaboration, expertise and making a difference. Our organization sets big, hairy audacious goals and works tirelessly to support states in transforming education through student-centered policies that increase student learning, expand opportunity and ready students for college and the workforce. Essential Duties & Responsibilities Develops robust, student-centered policy solutions, fundamental principles and innovations to support states with education choice. Supports state leaders with policy solutions aligned to state needs. Guides and supports state policy implementation and technical assistance to establish or accelerate ExcelinEd’s public school choice policy agenda, including identifying and solving for barriers to implementation. Provides expert testimony to legislative and executive committees and serves as a national thought leader on education choice, promoting policy solutions on panels at education conferences, workshops, convenings and webinars and through channels such as podcasts and state and national media. Develops model policies, policy toolkits, briefs and white papers and conducts comprehensive reviews of existing state laws and policies. Develops and manages public school choice policy research objectives; conducts policy and analyses. Supports ExcelinEd’s multi-state policy convenings; drafts meeting agendas, identifies speakers and hosts workshops and webinars. Assists with building strategy session agendas for the annual National Summit on Education. Drafts blogs, talking points, briefings, summaries and presentations for internal and external purposes. Responds to email questions and comments related to policy from policymakers, aides and the public. Travels on behalf of the organization and serves as a representative at events. Assists with communications and messaging by supplying facts and writing and editing communications pieces for policy information and accuracy. Assists business development by contributing to philanthropic engagement, grant writing and reporting. Prepares briefing materials for the organization’s executive management and Board of Directors. Preferred Skills/Qualifications A background in Education, Public Policy, Social Science, Political Science, Public Administration or an associated subject is desirable. Strong writing and communication skills. Ability to speak publicly before policymakers and executives. Strong organizational and teamwork skills. Expertise in the development or implementation of education choice policy. Strong understanding of the intersection of politics, policy and the legislative process. Proven success in collaborating, partnering and influencing?across teams?and organizations to drive results in matrixed environments. Ability to thrive with ambiguity, manage relationships and handle complex work assignments. Requirements 7-10 years of experience working in public or private school choice or K-12 education policy at a state executive or legislative level or with a state or national policy organization. Minimum of a bachelor’s degree; advanced degree in public policy or education preferred. To Apply Qualified candidates may apply online via this job portal link: Job Application: Policy Director, Education Choice Required application materials to be submitted online include the following: Employment Application Cover letter detailing your interest in the position, how your background and experience makes you a good fit for the position and your salary requirements Resume Questions can be directed to EmployeeServices@ExcelinEd.org There is no application deadline for this position. Applications are accepted on a rolling basis. This job will remain posted on our site until filled."
  }
]